app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "hello@hello.io"], ["password_digest", "$2a$10$Oi2rsZzYbneobsJP.UyhyOyxgz7GHZATG3CriUMpZOWsnazWyJ55q"], ["session_token", "N2NRIEKXBy0oa0A94bM7UA"]]
---
  def create
    @user = User.new(user_params)
    if @user.save!