app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "ZHtSsF1CbXwgH4ZPGpqDYw"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!